app/controllers/admin/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."provider_id" = $1 ORDER BY "products"."created_at" DESC  [["provider_id", 6]]
---
  def index
    @products = Product.where(provider_id: current_user.id)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def show
    @product = Product.find(params[:id])

SELECT "categories".* FROM "categories"
---
  def new
    @product = Product.new
    @categories = Category.all

INSERT INTO "products" ("title", "description", "price", "image_url", "provider_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @product = Product.create(title: params[:title], description: params[:description], price: params[:price], image_url: params[:image_url], category_id: params[:category_id],provider_id: current_user.id)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def edit
    @product = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "products" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["title", "koba razana"], ["description", "vita malagasy "], ["updated_at", "2019-09-14 04:52:43.052675"], ["id", 7]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update(title: params[:title], description: params[:description], price: params[:price], picture: params[:picture], provider_id: current_user.id)

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 26]]
---
  def destroy
    @product = Product.find(params[:id])
    if @product.destroy