app/controllers/admin/users_controller.rb

SELECT "cart_products".* FROM "cart_products" WHERE "cart_products"."product_id" = $1  [["product_id", 6]]
SELECT "products".* FROM "products"
---
	def index
		@products = Product.all