app/views/admin/products/new.html.erb

SELECT "categories".* FROM "categories"
---

                  <%=select_tag 'category_id', options_for_select(Category.all.collect{ |c| [c.title, c.id] }), class: "form-input"%>