app/views/admin/products/new.html.erb


<%=select_tag 'category_id', options_for_select(Category.all.collect{ |c| [c.title, c.id] }), class: "form-control"%>
---
SELECT "categories".* FROM "categories"