app/controllers/accueil_controller.rb

  def index
  	@products = Product.all
  	@provider = User.find(rand(User.first.id)..(User.last.id))
---
SELECT "products".* FROM "products"
SELECT "users".* FROM "users" WHERE "users"."id" BETWEEN $1 AND $2 LIMIT $3  [["id", 0], ["id", 1], ["LIMIT", 1]]