app/controllers/carts_controller.rb

SELECT "products".* FROM "products" INNER JOIN "cart_products" ON "products"."id" = "cart_products"."product_id" WHERE "cart_products"."cart_id" = $1  [["cart_id", 6]]
SELECT 1 AS one FROM "products" INNER JOIN "cart_products" ON "products"."id" = "cart_products"."product_id" WHERE "cart_products"."cart_id" = $1 AND "products"."id" = $2 LIMIT $3  [["cart_id", 6], ["id", 2], ["LIMIT", 1]]
INSERT INTO "cart_products" ("cart_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cart_id", 6], ["product_id", 2], ["created_at", "2019-09-14 04:19:57.742270"], ["updated_at", "2019-09-14 04:19:57.742270"]]
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def create
   if user_signed_in?

     if current_user.cart.products.include?(Product.find(params[:format])) == false || current_user.cart.products == nil
        CartProduct.create( cart: current_user.cart, product: Product.find(params[:format]) )

SELECT "products".* FROM "products" INNER JOIN "cart_products" ON "products"."id" = "cart_products"."product_id" WHERE "cart_products"."cart_id" = $1  [["cart_id", 17]]
---
  def show
    if user_signed_in?
         @price_total = 0
         @cart_products = current_user.cart.products
         @cart_products.each do |cart_product|

SELECT "cart_products".* FROM "cart_products" WHERE "cart_products"."product_id" = $1 AND "cart_products"."cart_id" = $2 LIMIT $3  [["product_id", 5], ["cart_id", 17], ["LIMIT", 1]]
DELETE FROM "cart_products" WHERE "cart_products"."id" = $1  [["id", 1]]
---
 def destroy
   @cart_product = CartProduct.find_by(product_id:params[:id], cart_id: current_user.cart.id)
   @cart_product.destroy