app/controllers/categories_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."created_at" ASC
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
    @products = Product.all
    if user_signed_in? && current_user.is_admin == true
      redirect_to admin_products_path
    end
    @category = Category.find(params[:id])