app/controllers/charges_controller.rb

	def create
	  @cart = current_user.cart
	  # .to_i to avoid the bug generated by the decimal
	  @amount = @cart.total_price.to_i

	  customer = Stripe::Customer.create({
	  	email: params[:stripeEmail],
	  	source: params[:stripeToken],
	  })

	  charge = Stripe::Charge.create({
	  	customer: customer.id,
	  	amount: @amount * 100,
	  	description: 'Rails Stripe customer',
	  	currency: 'eur',
	  })

		# We stock the cart's items in a variable
		@cart_products = @cart.products

		# We create a new order
		@command = Command.create(stripe_customer_id: customer.id, customer_id: current_user.id)

		# Each item of this card is put in the order item table (with the id of the current order)
		@cart_products.each do |cart_product|
			CommandProduct.create(command_id: @command.id, product_id: product.id)
		end


		# we empty the cart
		CartProduct.where(cart_id: @cart.id).each do |entry|
---
INSERT INTO "commands" ("stripe_customer_id", "customer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["stripe_customer_id", "cus_FpLcXpL1LrMkSQ"], ["customer_id", 19], ["created_at", "2019-09-17 13:40:33.027401"], ["updated_at", "2019-09-17 13:40:33.027401"]]
SELECT "cart_products".* FROM "cart_products" WHERE "cart_products"."cart_id" = $1  [["cart_id", 17]]
SELECT "products".* FROM "products" INNER JOIN "cart_products" ON "products"."id" = "cart_products"."product_id" WHERE "cart_products"."cart_id" = $1  [["cart_id", 17]]
SELECT SUM("products"."price") FROM "products" INNER JOIN "cart_products" ON "products"."id" = "cart_products"."product_id" WHERE "cart_products"."cart_id" = $1  [["cart_id", 17]]