app/controllers/charges_controller.rb

	def new
		@cart = current_user.cart
		@cart_products = @cart.products

		@amount = 0
        @cart_products = current_user.cart.cartProducts
        @cart_products.each do |cart_product|
---
SELECT "products".* FROM "products" INNER JOIN "cart_products" ON "products"."id" = "cart_products"."product_id" WHERE "cart_products"."cart_id" = $1  [["cart_id", 17]]