app/controllers/likes_controller.rb

  def create
    if already_liked?

    else
      @product.likes.create(customer_id: current_user.id)
---
INSERT INTO "likes" ("customer_id", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["customer_id", 21], ["product_id", 5], ["created_at", "2019-09-18 07:16:40.218617"], ["updated_at", "2019-09-18 07:16:40.218617"]]

  def find_product
    @product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def already_liked?
    Like.where(customer_id: current_user.id, product_id:
    params[:product_id]).exists?
---
SELECT 1 AS one FROM "likes" WHERE "likes"."customer_id" = $1 AND "likes"."product_id" = $2 LIMIT $3  [["customer_id", 21], ["product_id", 5], ["LIMIT", 1]]