app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."created_at" ASC
---
  def index
    @validate_product = Product.where(validation: true)
    @q = @validate_product.search(params[:q])

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @product = Product.find(params[:id])