app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def edit
       @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "is_admin" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["is_admin", true], ["updated_at", "2019-09-14 03:52:07.823544"], ["id", 7]]
UPDATE "users" SET "is_admin" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["is_admin", false], ["updated_at", "2019-09-13 21:41:11.871063"], ["id", 6]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "manana"], ["last_name", "amak"], ["updated_at", "2019-09-14 03:52:07.867755"], ["id", 7]]
---
  def update
  	 @user = User.find(params[:id])

  	 is_admin = params[:is_admin]
  	if is_admin.to_i == 1
    	@user.is_admin = true
    	@user.save
    else
    	@user.is_admin = false
     	@user.save
    end
    if @user.update(first_name: params[:first_name], last_name: params[:last_name], email: params[:email])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show
  	@user = User.find(params[:id])