app/models/user.rb

INSERT INTO "carts" ("customer_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["customer_id", 8], ["created_at", "2019-09-13 23:34:22.868561"], ["updated_at", "2019-09-13 23:34:22.868561"]]
---
  def add_cart
    Cart.create(customer_id: self.id)