app/views/admin/users/index.html.erb

SELECT "products".* FROM "products"
SELECT "cart_products".* FROM "cart_products" WHERE "cart_products"."product_id" = $1  [["product_id", 6]]
---
					<%if product.provider == current_user%>
					<%product.cartProducts.each do |cartProduct|%>

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
							<%= "ID: #{cartProduct.cart.customer.id}" %><hr>
							<%= cartProduct.cart.customer.first_name %>

SELECT "cart_products".* FROM "cart_products" WHERE "cart_products"."product_id" = $1  [["product_id", 5]]
SELECT "products".* FROM "products"
SELECT "command_products".* FROM "command_products" WHERE "command_products"."product_id" = $1  [["product_id", 6]]
---
					<%end%>
					<%product.commandProducts.each do |commandProduct|%>