app/views/products/index.html.erb

                  <a href="<%= carts_path(prod[i].id)%>" class="btn btn-warning btn-sm" data-method="post">Ajouter au panier</a>
                  <%= prod[i].likes.count %> <%= (prod[i].likes.count) > 1 ? 'likes' : ''%><%= link_to '👍', product_likes_path(prod[i]), method: :post%>
---
SELECT "likes".* FROM "likes" WHERE "likes"."product_id" = $1  [["product_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."product_id" = $1  [["product_id", 5]]