app/views/accueil/index.html.erb

SELECT "products".* FROM "products" WHERE "products"."provider_id" = $1  [["provider_id", 1]]
---
        <div class="row">
          <%Product.where(provider_id: @provider.id).each do |p|%>