app/views/layouts/_footer.html.erb

            <ul class="list-unstyled">
                <%Category.all.each do |c|%>
---
SELECT "categories".* FROM "categories"