app/views/layouts/_nav.html.erb

SELECT "categories".* FROM "categories"
---
                  <ul class="dropdown">
                    <%Category.all.each do |c|%>

SELECT "products".* FROM "products" INNER JOIN "cart_products" ON "products"."id" = "cart_products"."product_id" WHERE "cart_products"."cart_id" = $1  [["cart_id", 17]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT COUNT(*) FROM "products" INNER JOIN "cart_products" ON "products"."id" = "cart_products"."product_id" WHERE "cart_products"."cart_id" = $1  [["cart_id", 20]]
---
            <span class="fas fa-shopping-cart"></span>
              <span class="number"><%= Cart.find(current_user.cart.id).products.count%></span>